; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	spectrograph3 - mode
	image4 - mode
	image1 - mode
	infrared0 - mode
	spectrograph2 - mode
	Star5 - direction
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 image4)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 GroundStation4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 spectrograph3)
	(supports instrument1 image4)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph2)
	(supports instrument2 infrared0)
	(supports instrument2 image1)
	(calibration_target instrument2 Star5)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet7)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star2)
	(supports instrument5 image4)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation3)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph3)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet10)
	(supports instrument7 infrared0)
	(supports instrument7 image1)
	(supports instrument7 image4)
	(calibration_target instrument7 GroundStation4)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 image1)
	(supports instrument8 spectrograph2)
	(calibration_target instrument8 GroundStation3)
	(calibration_target instrument8 Star2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon11)
	(supports instrument9 spectrograph2)
	(supports instrument9 image4)
	(calibration_target instrument9 GroundStation4)
	(supports instrument10 image1)
	(supports instrument10 image4)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument11 spectrograph3)
	(supports instrument11 image4)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 GroundStation3)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation4)
)
(:goal (and
	(pointing satellite3 Star1)
	(pointing satellite5 Phenomenon6)
	(have_image Phenomenon6 spectrograph3)
	(have_image Planet7 spectrograph3)
	(have_image Star8 image1)
	(have_image Planet9 spectrograph3)
	(have_image Planet10 image1)
	(have_image Phenomenon11 image1)
	(have_image Star12 spectrograph2)
))

)

; plan
1. (turn_to satellite5 groundstation3 groundstation4)
   deleted: (pointing satellite5 groundstation4)
   added: (pointing satellite5 groundstation3)
   goals met: 0 of 9
2. (switch_on instrument11 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument11)
   goals met: 0 of 9
3. (calibrate satellite5 instrument11 groundstation3)
   added: (calibrated instrument11)
   goals met: 0 of 9
4. (turn_to satellite5 star12 groundstation3)
   deleted: (pointing satellite5 groundstation3)
   added: (pointing satellite5 star12)
   goals met: 0 of 9
5. (take_image satellite5 star12 instrument11 spectrograph2)
   added: (have_image star12 spectrograph2)
   goals met: 1 of 9
6. (turn_to satellite5 planet9 star12)
   deleted: (pointing satellite5 star12)
   added: (pointing satellite5 planet9)
   goals met: 1 of 9
7. (take_image satellite5 planet9 instrument11 spectrograph3)
   added: (have_image planet9 spectrograph3)
   goals met: 2 of 9
8. (turn_to satellite5 planet7 planet9)
   deleted: (pointing satellite5 planet9)
   added: (pointing satellite5 planet7)
   goals met: 2 of 9
9. (turn_to satellite3 star1 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star1)
   goals met: 3 of 9
10. (take_image satellite5 planet7 instrument11 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 4 of 9
11. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 4 of 9
12. (calibrate satellite4 instrument10 groundstation3)
   added: (calibrated instrument10)
   goals met: 4 of 9
13. (turn_to satellite4 phenomenon11 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 phenomenon11)
   goals met: 4 of 9
14. (take_image satellite4 phenomenon11 instrument10 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 9
15. (turn_to satellite4 planet10 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet10)
   goals met: 5 of 9
16. (take_image satellite4 planet10 instrument10 image1)
   added: (have_image planet10 image1)
   goals met: 6 of 9
17. (turn_to satellite4 star8 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star8)
   goals met: 6 of 9
18. (take_image satellite4 star8 instrument10 image1)
   added: (have_image star8 image1)
   goals met: 7 of 9
19. (turn_to satellite5 phenomenon6 planet7)
   deleted: (pointing satellite5 planet7)
   added: (pointing satellite5 phenomenon6)
   goals met: 8 of 9
20. (take_image satellite5 phenomenon6 instrument11 spectrograph3)
   added: (have_image phenomenon6 spectrograph3)
   goals met: 9 of 9
